
while(入口条件)
{
    语句1;
}
语句2;
当入口条件为真：执行流：while，入口条件，{，语句1，}，入口条件
当入口条件为真：执行流：while，入口条件，语句2
2.
while(入口条件)
{
    语句1;
    break;
    语句2;
}
语句3;
3.
while(入口条件)
{
    语句1;
    continue;
    语句2;
}
语句3;
4.
do
{
    语句1;
}
while(出口条件)
语句2;
5.
for(初始化;条件;调整)
{
    语句1;
}
语句2;
6.
for(初始化;条件;调整)
{
    语句1;
    break;
    语句2;
}
语句3;
7.
for(初始化;条件;调整)
{
    语句1;
    continue;
    语句2;
}
语句3;
8.
if(入口条件)
{
    语句1;
}
语句2;
9.
if(入口条件)
{
    语句1;
}
else
{
    语句2;
}
语句3;
10.
if(入口条件1)
{
    语句1;
}
else if(入口条件2)
{
    语句2;
}
else if(入口条件3)
{
    语句3;
}
语句4;
11.
switch(整数常量表达式)
{
    case 1: 语句1;
    case 2: 语句2;
    default: 语句3;
}
语句4;
12.
switch(整数常量表达式)
{
    case 1: 语句1;break;
    case 2: 语句2;
    default: 语句3;
}
语句4;
13.
switch(整数常量表达式)
{
    case 1: 语句1;break;
    case 2: 语句2;break;
    default: 语句3;
}
语句4;